In [8]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

In [9]:
data=pd.read_csv('Data.csv')

In [10]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## Removing the rows with null values

In [11]:
data.dropna()

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [12]:
data['Salary'].describe()

count        9.000000
mean     63777.777778
std      12265.579662
min      48000.000000
25%      54000.000000
50%      61000.000000
75%      72000.000000
max      83000.000000
Name: Salary, dtype: float64

## Imputer

In [13]:
imputer=SimpleImputer(missing_values=np.nan, strategy='mean')

In [16]:
data.iloc[:,1:3].values

array([[4.4e+01, 7.2e+04],
       [2.7e+01, 4.8e+04],
       [3.0e+01, 5.4e+04],
       [3.8e+01, 6.1e+04],
       [4.0e+01,     nan],
       [3.5e+01, 5.8e+04],
       [    nan, 5.2e+04],
       [4.8e+01, 7.9e+04],
       [5.0e+01, 8.3e+04],
       [3.7e+01, 6.7e+04]])

In [24]:
imputer.fit(data.iloc[:,1:3].values)
x=imputer.transform(data.iloc[:,1:3].values)

In [25]:
data.iloc[:,1:3]=x

In [26]:
data    # all the null values in the column are replaced by the mean of the whole column

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000       Yes
1    Spain  27.000000  48000.000000       Yes
2      NaN  30.000000  54000.000000       NaN
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes